In [1]:
pip install pandas

Collecting pandas
  Downloading pandas-1.4.2-cp39-cp39-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (11.7 MB)
     |████████████████████████████████| 11.7 MB 1.4 MB/s
Requirement already satisfied: python-dateutil>=2.8.1 in /home/sam/.local/plugins/miniconda3/lib/python3.9/site-packages (from pandas) (2.8.2)
Collecting pytz>=2020.1
  Downloading pytz-2022.1-py2.py3-none-any.whl (503 kB)
     |████████████████████████████████| 503 kB 11.4 MB/s
Collecting numpy>=1.18.5
  Downloading numpy-1.22.3-cp39-cp39-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (16.8 MB)
     |████████████████████████████████| 16.8 MB 11.8 MB/s
Requirement already satisfied: six>=1.5 in /home/sam/.local/plugins/miniconda3/lib/python3.9/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Installing collected packages: pytz, numpy, pandas
Successfully installed numpy-1.22.3 pandas-1.4.2 pytz-2022.1
WARNING: You are using pip version 21.3.1; however, version 22.0.4 is available.
You should consider upgrading via the '/home/sam/.local/plugins/miniconda3/bin/python -m pip install --upgrade pip' command.
Note: you may need to restart the kernel to use updated packages.

In [ ]:
pip install matplotlib

In [3]:
# Test if pandas was installed
import pandas as pd

In [6]:
# Importing Sales Data
df = pd.read_csv('sales.csv')

# if an error occurs, double check if sales.csv is inside your project folder where .ipynb is located

In [7]:
# viewing/selecting one column
print(df['Person'])
# viewing/selecting multiple columns
columns_to_read = ['Person','Sales']
print(df[columns_to_read])

0        Sam
1    Charlie
2        Amy
3    Vanessa
4       Carl
5      Sarah
Name: Person, dtype: object
    Person  Sales
0      Sam    200
1  Charlie    120
2      Amy    340
3  Vanessa    124
4     Carl    243
5    Sarah    350

In [8]:
# creating new columns
df['SalesTax'] = df['Sales'] * df['Tax']
print(df)

  Company   Person  Sales   Tax  SalesTax
0    GOOG      Sam    200  0.12     24.00
1    GOOG  Charlie    120  0.12     14.40
2    MSFT      Amy    340  0.08     27.20
3    MSFT  Vanessa    124  0.07      8.68
4      FB     Carl    243  0.06     14.58
5      FB    Sarah    350  0.12     42.00

In [9]:
# creating new columns
df['SalesTax'] = df['Sales'] * df['Tax']
print(df)

  Company   Person  Sales   Tax  SalesTax
0    GOOG      Sam    200  0.12     24.00
1    GOOG  Charlie    120  0.12     14.40
2    MSFT      Amy    340  0.08     27.20
3    MSFT  Vanessa    124  0.07      8.68
4      FB     Carl    243  0.06     14.58
5      FB    Sarah    350  0.12     42.00

In [10]:
# permanently delete column
df.drop('SalesTax',axis=1, inplace = True)
print(df)

  Company   Person  Sales   Tax
0    GOOG      Sam    200  0.12
1    GOOG  Charlie    120  0.12
2    MSFT      Amy    340  0.08
3    MSFT  Vanessa    124  0.07
4      FB     Carl    243  0.06
5      FB    Sarah    350  0.12

In [12]:
# Df Row Ops
# reset df
df = pd.read_csv("sales.csv")

# select second row
print(df.iloc[1])

Company       GOOG
Person     Charlie
Sales          120
Tax           0.12
Name: 1, dtype: object

In [13]:
# select third to fourth row
print(df.iloc[2:4])

  Company   Person  Sales   Tax
2    MSFT      Amy    340  0.08
3    MSFT  Vanessa    124  0.07

In [14]:
# create a new copy of df
df2 = df.copy()
print(df2)

  Company   Person  Sales   Tax
0    GOOG      Sam    200  0.12
1    GOOG  Charlie    120  0.12
2    MSFT      Amy    340  0.08
3    MSFT  Vanessa    124  0.07
4      FB     Carl    243  0.06
5      FB    Sarah    350  0.12

In [15]:
# make Person the Labels of Each Row
df2.set_index("Person", inplace = True)
print(df2)

        Company  Sales   Tax
Person
Sam        GOOG    200  0.12
Charlie    GOOG    120  0.12
Amy        MSFT    340  0.08
Vanessa    MSFT    124  0.07
Carl         FB    243  0.06
Sarah        FB    350  0.12

In [16]:
# Select the row for Sam
print(df.iloc[0])
print(df2.loc['Sam'])

Company    GOOG
Person      Sam
Sales       200
Tax        0.12
Name: 0, dtype: object
Company    GOOG
Sales       200
Tax        0.12
Name: Sam, dtype: object

In [17]:
# Select Rows for Sam and Amy
print(df2.loc[['Sam','Amy']])

       Company  Sales   Tax
Person
Sam       GOOG    200  0.12
Amy       MSFT    340  0.08

In [18]:
# Select Rows for Sam and Amy and
# show only Company and Tax
print(df2.loc[['Sam','Amy'],['Company','Tax']])

       Company   Tax
Person
Sam       GOOG  0.12
Amy       MSFT  0.08

In [19]:
# identify rows of where sales > 150
print(df['Sales'])
print(df['Sales'] >150)

0    200
1    120
2    340
3    124
4    243
5    350
Name: Sales, dtype: int64
0     True
1    False
2     True
3    False
4     True
5     True
Name: Sales, dtype: bool

In [20]:
# select rows of df where sales >150
print(df[df['Sales'] >150])

  Company Person  Sales   Tax
0    GOOG    Sam    200  0.12
2    MSFT    Amy    340  0.08
4      FB   Carl    243  0.06
5      FB  Sarah    350  0.12

In [22]:
# select rows of df where Sales >150 and select only columns 
#Person and Tax
print(df[df['Sales']>150][['Person', 'Tax']])

  Person   Tax
0    Sam  0.12
2    Amy  0.08
4   Carl  0.06
5  Sarah  0.12

In [23]:
# select rows of df where Sales >150 and select only rows 
#Company #= FB and select only columns Person and Tax
print(df[(df['Sales'] >150) & (df['Company']=='FB')][['Person','Tax']])

  Person   Tax
4   Carl  0.06
5  Sarah  0.12

In [24]:
#Summarizing Data
print(df.mean())
print("\n")
print(df.std())
print("\n")
print(df.min())
print("\n")
print(df.max())
print("\n")
print(df.count())
print("\n")
print(df.describe())

Sales    229.500
Tax        0.095
dtype: float64


Sales    100.899455
Tax        0.028107
dtype: float64


Company      FB
Person      Amy
Sales       120
Tax        0.06
dtype: object


Company       MSFT
Person     Vanessa
Sales          350
Tax           0.12
dtype: object


Company    6
Person     6
Sales      6
Tax        6
dtype: int64


            Sales       Tax
count    6.000000  6.000000
mean   229.500000  0.095000
std    100.899455  0.028107
min    120.000000  0.060000
25%    143.000000  0.072500
50%    221.500000  0.100000
75%    315.750000  0.120000
max    350.000000  0.120000

/tmp/ipykernel_15860/1344212576.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  print(df.mean())
/tmp/ipykernel_15860/1344212576.py:4: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  print(df.std())

In [25]:
# groupby aggregation
by_comp = df.groupby("Company")
print(by_comp.mean())
print("\n")
print(by_comp.std())
print("\n")
print(by_comp.min())
print("\n")
print(by_comp.max())
print("\n")
print(by_comp.count())
print("\n")
print(by_comp.describe())

         Sales    Tax
Company
FB       296.5  0.090
GOOG     160.0  0.120
MSFT     232.0  0.075


              Sales       Tax
Company
FB        75.660426  0.042426
GOOG      56.568542  0.000000
MSFT     152.735065  0.007071


          Person  Sales   Tax
Company
FB          Carl    243  0.06
GOOG     Charlie    120  0.12
MSFT         Amy    124  0.07


          Person  Sales   Tax
Company
FB         Sarah    350  0.12
GOOG         Sam    200  0.12
MSFT     Vanessa    340  0.08


         Person  Sales  Tax
Company
FB            2      2    2
GOOG          2      2    2
MSFT          2      2    2


        Sales                                                           Tax  \
        count   mean         std    min     25%    50%     75%    max count
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0   2.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0   2.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0   2.0


          mean       std   min     25%    50%     75%   max
Company
FB       0.090  0.042426  0.06  0.0750  0.090  0.1050  0.12
GOOG     0.120  0.000000  0.12  0.1200  0.120  0.1200  0.12
MSFT     0.075  0.007071  0.07  0.0725  0.075  0.0775  0.08

In [26]:
print(df)
dfmelted = df.copy()
dfmelted = pd.melt(dfmelted, id_vars=['Company'], value_vars=['Sales', 'Person', 'Tax'])
print(dfmelted)

  Company   Person  Sales   Tax
0    GOOG      Sam    200  0.12
1    GOOG  Charlie    120  0.12
2    MSFT      Amy    340  0.08
3    MSFT  Vanessa    124  0.07
4      FB     Carl    243  0.06
5      FB    Sarah    350  0.12
   Company variable    value
0     GOOG    Sales      200
1     GOOG    Sales      120
2     MSFT    Sales      340
3     MSFT    Sales      124
4       FB    Sales      243
5       FB    Sales      350
6     GOOG   Person      Sam
7     GOOG   Person  Charlie
8     MSFT   Person      Amy
9     MSFT   Person  Vanessa
10      FB   Person     Carl
11      FB   Person    Sarah
12    GOOG      Tax     0.12
13    GOOG      Tax     0.12
14    MSFT      Tax     0.08
15    MSFT      Tax     0.07
16      FB      Tax     0.06
17      FB      Tax     0.12

In [27]:
print(df)
dfpivot = df.copy()
dfpivot = dfpivot.pivot(index='Person', columns='Company', values='Sales')
print(dfpivot)

  Company   Person  Sales   Tax
0    GOOG      Sam    200  0.12
1    GOOG  Charlie    120  0.12
2    MSFT      Amy    340  0.08
3    MSFT  Vanessa    124  0.07
4      FB     Carl    243  0.06
5      FB    Sarah    350  0.12
Company     FB   GOOG   MSFT
Person
Amy        NaN    NaN  340.0
Carl     243.0    NaN    NaN
Charlie    NaN  120.0    NaN
Sam        NaN  200.0    NaN
Sarah    350.0    NaN    NaN
Vanessa    NaN    NaN  124.0

In [28]:
# setup dataframes for joining
df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [1, 2, 3, 5]})
df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [5, 6, 7, 8]})
print(df1)
print(df2)

  lkey  value
0  foo      1
1  bar      2
2  baz      3
3  foo      5
  rkey  value
0  foo      5
1  bar      6
2  baz      7
3  foo      8

In [29]:
# merging df1 and df2 where id is df1.lkey and df2.lkey
df1.merge(df2, left_on='lkey', right_on='rkey')

  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  foo        5  foo        5
3  foo        5  foo        8
4  bar        2  bar        6
5  baz        3  baz        7

In [30]:
# setup dataframes for concatenating
df1 = pd.DataFrame([['a', 1], ['b', 2]],
                   columns=['letter', 'number'])
df2 = pd.DataFrame([['c', 3], ['d', 4]],
                   columns=['letter', 'number'])
print(df1)
print(df2)

  letter  number
0      a       1
1      b       2
  letter  number
0      c       3
1      d       4

In [31]:
# concatenating dataframes in row axis
pd.concat([df1, df2])

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [32]:
# setup for concatenating
df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
                   columns=['animal', 'name'])
print(df4)

   animal    name
0    bird   polly
1  monkey  george

In [33]:
# concatenating dataframes in column axis
pd.concat([df1, df4], axis=1)

  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

In [34]:
# Equal Width Binning
import numpy as np
df = pd.read_csv("sales.csv") #reset df
dfbinned = df.copy()
bin_labels_3 = ['Low', 'Medium', 'High']
cutbins = np.arange(0,4,1)/3*(df['Tax'].max() - df['Tax'].min())+df['Tax'].min()
print(cutbins)
dfbinned['TaxDiscrete'] = pd.cut(df['Tax'], bins=cutbins, labels=bin_labels_3)
dfbinned=dfbinned.fillna(value="Low")
print(dfbinned)

[0.06 0.08 0.1  0.12]
  Company   Person  Sales   Tax TaxDiscrete
0    GOOG      Sam    200  0.12        High
1    GOOG  Charlie    120  0.12        High
2    MSFT      Amy    340  0.08      Medium
3    MSFT  Vanessa    124  0.07         Low
4      FB     Carl    243  0.06         Low
5      FB    Sarah    350  0.12        High

In [35]:
# Equal Depth Binning
dfbinned = df.copy()
bin_labels_3 = ['Low', 'Medium', 'High']
dfbinned['SalesDiscrete'] = pd.qcut(df['Sales'], q=3, labels=bin_labels_3)
print(dfbinned)

  Company   Person  Sales   Tax SalesDiscrete
0    GOOG      Sam    200  0.12        Medium
1    GOOG  Charlie    120  0.12           Low
2    MSFT      Amy    340  0.08          High
3    MSFT  Vanessa    124  0.07           Low
4      FB     Carl    243  0.06        Medium
5      FB    Sarah    350  0.12          High

In [36]:
df = pd.read_csv("sales.csv") #reset df
dfencoding = df.copy()
df['Company'].unique()
dummies = pd.get_dummies(dfencoding['Company'], prefix='Company')
dfencoding = pd.concat([dfencoding,dummies], axis=1)
print(dfencoding)

  Company   Person  Sales   Tax  Company_FB  Company_GOOG  Company_MSFT
0    GOOG      Sam    200  0.12           0             1             0
1    GOOG  Charlie    120  0.12           0             1             0
2    MSFT      Amy    340  0.08           0             0             1
3    MSFT  Vanessa    124  0.07           0             0             1
4      FB     Carl    243  0.06           1             0             0
5      FB    Sarah    350  0.12           1             0             0

In [37]:
# Setting up dataframe for missing data handling
import numpy as np #dependent library
df = pd.DataFrame([[np.nan, 2, np.nan, 0],
                   [3, 4, np.nan, 1],
                   [np.nan, np.nan, np.nan, np.nan],
                   [np.nan, 3, np.nan, 4]],
                  columns=list("ABCD"))
print(df)

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  NaN NaN  NaN
3  NaN  3.0 NaN  4.0

In [38]:
# Filling missing data
df.fillna(0)

     A    B    C    D
0  0.0  2.0  0.0  0.0
1  3.0  4.0  0.0  1.0
2  0.0  0.0  0.0  0.0
3  0.0  3.0  0.0  4.0

In [39]:
# simple random sampling
dfsample = df.copy()
dfsamplesubset = dfsample.sample(n=3,replace=True, 
random_state=1)
print(dfsamplesubset)

     A    B   C    D
1  3.0  4.0 NaN  1.0
3  NaN  3.0 NaN  4.0
0  NaN  2.0 NaN  0.0